app/views/posts/search.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."post_id" = 15
---
                              new_vote_path(:post_id=>post.id) %>
                  <% if post.votes.count!=0 %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 15
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 15
---
                              new_comment_path(:post_id=>post.id, :post_question=>post.question) %>
                  <% if post.comments.count!=0 %>

SELECT COUNT(*) FROM "comment_votes" WHERE "comment_votes"."comment_id" = 22
---
                                    new_comment_vote_path(:comment_id=>comment.id) %>
                        <% if comment.comment_votes.count!=0 %>